package Lesson_5;

public class Task1 {
    /*
    1. Unit test - "test_add_contact_success": проверка корректного добавления контакта в записную книжку.
2. Unit test - "test_add_contact_failure": проверка возникновения ошибки при попытке добавить контакт с некорректными
 данными в записную книжку.
3. Unit test - "test_edit_contact_success": проверка успешного редактирования контакта в записной книжке.
4. Unit test - "test_edit_contact_failure": проверка возникновения ошибки при попытке редактирования несуществующего
контакта в записной книжке.
5. Unit test - "test_delete_contact_success": проверка успешного удаления контакта из записной книжки.
6. Unit test - "test_delete_contact_failure": проверка возникновения ошибки при попытке удаления несуществующего
контакта из записной книжки.
7. Integration test - "test_add_and_retrieve_contacts": проверка добавления и получения контактов из записной книжки,
чтобы убедиться, что данные корректно сохраняются и извлекаются из хранилища.
8. Integration test - "test_edit_and_retrieve_contacts": проверка редактирования и получения контактов из записной
книжки, чтобы убедиться, что изменения сохраняются и данные извлекаются корректно.
9. Integration test - "test_delete_and_retrieve_contacts": проверка удаления и получения контактов из записной книжки,
чтобы убедиться, что удаленные контакты больше не доступны после удаления.
10. End-to-end test - "test_add_edit_delete_contact_workflow": проверка полного рабочего процесса добавления,
редактирования и удаления контакта из записной книжки, чтобы убедиться, что все функции работают вместе без ошибок.
     */
}
