package Lesson_5;

public class Task2 {
    /*
  1. "Проверка того, что функция addContact корректно добавляет новый контакт в список контактов": это юнит-тест,
  так как он проверяет функцию addContact в отрыве от других компонентов и зависимостей. Тестирование функций является
  одним из основных принципов юнит-тестирования.

2. "Проверка того, что при добавлении контакта через пользовательский интерфейс, контакт корректно отображается
 в списке контактов": это интеграционный тест. Он проверяет взаимодействие между пользовательским интерфейсом
 и списком контактов. В данном случае, тестируется работа системы в целом, включая функциональность и
 корректность взаимодействия различных компонентов.

3. "Проверка полного цикла работы с контактом: создание контакта, его редактирование и последующее удаление":
это сквозной тест. Он охватывает несколько компонентов или функций и проверяет их взаимодействие на разных
этапах работы системы. В данном случае, тестирование цикла работы с контактом позволяет проверить, что все
этапы (создание, редактирование, удаление) выполняются корректно и не приводят к ошибкам или неконсистентности данных.
     */
}
